app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$04$ykIjzj5oYRw65NLLNW/E7OtUyQCE0sRC9Bs1NOxl6qP.RXVn0flVK', "remember_token" = 'OeuDcoUtO_Bu40kMKUpMTA', "updated_at" = '2013-11-21 08:00:13.795204' WHERE "users"."id" = 1